## Topics
- 1. Read CSV
- 2. Write CSV
- 3. Read Excel
- 4. Writw Excel

In [1]:
import pandas as pd
df=pd.read_csv('stock_data.csv')#there are argument if you want to skip header skiprow or header=1
#if there is no header in dataset then write header=None in argument so it will automatically give header you want by supplyinf names=['ronak','epds','revenue'] 
#df=pd.read_csv('stock.csv',header=None,names=['company','no','price','employee'])
#if you have big dataset and you want to print only first 03 columns then df=pd.read_csv("stock_data.csv",nrows=3)
# we can see that here there are not available and n.a values and i want that value should be na_values so, syntax will be
#df=pd.read_csv("stock.csv",na_values=['not availabel','n.a'])
df

  tickers            eps  revenue price         people
0   GOOGL          27.82       87   845     larry page
1     WMT           4.61      484    65           n.a.
2    MSFT             -1       85    64     bill gates
3    RIL   not available       50  1023  mukesh ambani
4    TATA            5.6       -1  n.a.     ratan tata

In [2]:
df=pd.read_csv("stock_data.csv",na_values=['not available','n.a.'])# so it will give nan in place of not availabel and n.a.
df

  tickers    eps  revenue   price         people
0   GOOGL  27.82       87   845.0     larry page
1     WMT   4.61      484    65.0            NaN
2    MSFT  -1.00       85    64.0     bill gates
3    RIL     NaN       50  1023.0  mukesh ambani
4    TATA   5.60       -1     NaN     ratan tata

In [3]:
#if i want to do specific change in spefic column then
df=pd.read_csv('stock_data.csv',na_values={
    'eps':['not availabel','n.a.'],
    'revenue':['not availbel','n.a.',-1],
    'people':['not availabel','n.a.']
    
})
df

  tickers            eps  revenue price         people
0   GOOGL          27.82     87.0   845     larry page
1     WMT           4.61    484.0    65            NaN
2    MSFT             -1     85.0    64     bill gates
3    RIL   not available     50.0  1023  mukesh ambani
4    TATA            5.6      NaN  n.a.     ratan tata

In [4]:
df.columns

Index(['tickers', 'eps', 'revenue', 'price', 'people'], dtype='object')

In [5]:
#export the csv
#writing to csv
df.to_csv('new.csv',index=False)

In [6]:
df.to_csv('new.csv',columns=['tickers','eps'],index=False)#header=False we can also write if i don't want header

## Excel

In [13]:
import pandas as pd
def convert_people_cell(cell):
    if cell=='n.a.':
        return 'sam walton'
    return cell
def convert_eps_cell(cell):
    if cell=="not available":
        return None
    return cell

df=pd.read_excel('stock_data_.xlsx',"Sheet1",converters={
    'people':convert_people_cell,
    'eps':convert_eps_cell
})
df

  tickers    eps  revenue price         people
0   GOOGL  27.82       87   845     larry page
1     WMT   4.61      484    65     sam walton
2    MSFT  -1.00       85    64     bill gates
3    RIL     NaN       50  1023  mukesh ambani
4    TATA   5.60       -1  n.a.     ratan tata

In [14]:
df.to_excel('new.xlsx',sheet_name='ronak',index=False)
#startrow=1,startcol=2

In [16]:
#i have two dataframe and i want to write in one excel file in different sheets
df_stocks=pd.DataFrame({
    'tikers':['GOOGle','parul university','nasscom'],
    'price':[845,65,64],
    'revenue':[87,484,50],
})
df_weather=pd.DataFrame({
    'day':['1/1/2017','1/2/2017','1/3/2017'],
    'temperature':[32,35,28],
    'event':['Rain','Sunny','Snow']
})

In [17]:
#in pandas there are excelwriter class that will save both sheet in single excel file
with pd.ExcelWriter('stock_weather_output.xlsx') as writer:
    df_stocks.to_excel(writer,sheet_name="stocks")
    df_weather.to_excel(writer,sheet_name="weather")